Revit 2027 API
BuiltInFailures.CurtainWallFailures.DanglingCurtainWallCorner Property
 A Corner Mullion has been placed at the end of a Curtain Wall that is not joined to another Curtain Wall. The angle of the Corner Mullion will default to 90 degrees.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DanglingCurtainWallCorner { get; }
Public Shared ReadOnly Property DanglingCurtainWallCorner As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DanglingCurtainWallCorner {
	FailureDefinitionId^ get ();
}
static member DanglingCurtainWallCorner : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace